SoyVitouPro/ESP32-V2/src/main.cpp
static const char* panelLabelForIndex(int idx) {
  static const char* labels[] = {"main","second","third","fourth","fifth","sixth","seventh","eighth"};
  int n = sizeof(labels)/sizeof(labels[0]);
  if (idx >= 0 && idx < n) return labels[idx];
  return "panel";
}

// Persistent storage functions
static void saveLastSettings() {
  nvs_handle_t nvs_handle;
  esp_err_t err = nvs_open("storage", NVS_READWRITE, &nvs_handle);
  if (err != ESP_OK) {
    Serial.printf("Error opening NVS: %s\n", esp_err_to_name(err));
    return;
  }

  // Update current settings
  lastSettings.animate = animate;
  lastSettings.animDir = animDir;
  lastSettings.animSpeedMs = animSpeedMs;
  lastSettings.loopOffsetPx = loopOffsetPx;
  lastSettings.bgColor = bgColor;
  lastSettings.textColor = textColor;  // ADD: Save text color
  lastSettings.mode = currentMode;
  lastSettings.hasText = !textPixels.empty();
  lastSettings.hasBgImage = hasBgImage;
  lastSettings.textWidth = imgW;
  lastSettings.textHeight = imgH;

  // Save current animation state - SIMPLE VERSION
  lastSettings.scrollX = scrollX;
  lastSettings.spacing = imgW + loopOffsetPx;
  lastSettings.savedTime = millis();

  // Save settings to NVS
  nvs_set_u8(nvs_handle, "animate", lastSettings.animate ? 1 : 0);
  nvs_set_i8(nvs_handle, "animDir", lastSettings.animDir);
  nvs_set_u16(nvs_handle, "animSpeedMs", lastSettings.animSpeedMs);
  nvs_set_u8(nvs_handle, "speedPercent", lastSettings.speedPercent);
  Serial.printf("Saving speed: percentage=%d%%, animSpeedMs=%d ms\n", lastSettings.speedPercent, lastSettings.animSpeedMs);
  nvs_set_i16(nvs_handle, "loopOffsetPx", lastSettings.loopOffsetPx);
  nvs_set_u16(nvs_handle, "bgColor", lastSettings.bgColor);
  nvs_set_u16(nvs_handle, "textColor", lastSettings.textColor);  // ADD: Save text color
  nvs_set_u8(nvs_handle, "mode", static_cast<uint8_t>(lastSettings.mode));
  nvs_set_u8(nvs_handle, "hasText", lastSettings.hasText ? 1 : 0);
  nvs_set_u8(nvs_handle, "hasBgImage", lastSettings.hasBgImage ? 1 : 0);
  nvs_set_u16(nvs_handle, "textWidth", lastSettings.textWidth);
  nvs_set_u16(nvs_handle, "textHeight", lastSettings.textHeight);

  // Save animation state
  nvs_set_i16(nvs_handle, "scrollX", lastSettings.scrollX);
  nvs_set_u16(nvs_handle, "spacing", lastSettings.spacing);
  nvs_set_u32(nvs_handle, "savedTime", lastSettings.savedTime);

  // Save brightness
  nvs_set_u8(nvs_handle, "brightness", currentBrightness);
  lastSettings.brightness = currentBrightness;

  // Commit NVS changes with retry mechanism
  err = nvs_commit(nvs_handle);
  if (err != ESP_OK) {
    Serial.printf("Error committing NVS: %s\n", esp_err_to_name(err));
    // Retry commit once
    delay(10);
    err = nvs_commit(nvs_handle);
    if (err != ESP_OK) {
      Serial.printf("Error committing NVS on retry: %s\n", esp_err_to_name(err));
    }
  } else {
    Serial.println("Settings saved to NVS successfully");
  }

  // Force verification of saved speed data
  uint8_t savedSpeedCheck = 0;
  esp_err_t checkErr = nvs_get_u8(nvs_handle, "speedPercent", &savedSpeedCheck);
  if (checkErr == ESP_OK) {
    Serial.printf("Verified speedPercent saved correctly: %d%%\n", savedSpeedCheck);
  } else {
    Serial.printf("ERROR: speedPercent not found in NVS after save! Error: %s\n", esp_err_to_name(checkErr));
  }

  nvs_close(nvs_handle);
}

static void loadLastSettings() {
  nvs_handle_t nvs_handle;
  esp_err_t err = nvs_open("storage", NVS_READONLY, &nvs_handle);
  if (err != ESP_OK) {
    Serial.println("No saved settings found, using defaults");
    return;
  }

  // Load settings from NVS
  uint8_t u8_val;
  int8_t i8_val;
  int16_t i16_val;
  uint16_t u16_val;

  if (nvs_get_u8(nvs_handle, "animate", &u8_val) == ESP_OK) {
    lastSettings.animate = (u8_val == 1);
    animate = lastSettings.animate;
  }
  if (nvs_get_i8(nvs_handle, "animDir", &i8_val) == ESP_OK) {
    lastSettings.animDir = i8_val;
    animDir = lastSettings.animDir;
  }
  // Prioritize speed percentage over old animSpeedMs for proper loading
  if (nvs_get_u8(nvs_handle, "speedPercent", &u8_val) == ESP_OK) {
    lastSettings.speedPercent = u8_val;
    // Recalculate animSpeedMs from saved percentage using aggressive mapping
    int targetMs;
    if (lastSettings.speedPercent == 10) {
      targetMs = 50;    // 0.5x of 100% speed (20 FPS)
    } else if (lastSettings.speedPercent == 20) {
      targetMs = 25;    // Same as current 100% speed (40 FPS)
    } else if (lastSettings.speedPercent == 40) {
      targetMs = 17;    // 1.5x faster than current 100% (59 FPS)
    } else if (lastSettings.speedPercent == 60) {
      targetMs = 13;    // 2x faster than current 100% (77 FPS)
    } else if (lastSettings.speedPercent == 80) {
      targetMs = 8;     // 3.5x faster than current 100% (125 FPS)
    } else if (lastSettings.speedPercent == 100) {
      targetMs = 6;     // 4x faster than current 100% (167 FPS)
    } else {
      // Linear interpolation between specific points
      targetMs = map(lastSettings.speedPercent, 10, 100, 50, 6);
    }
    animSpeedMs = targetMs;
    if (animSpeedMs < 6) animSpeedMs = 6;
    Serial.printf("SUCCESS: Loaded speed percentage: %d%%, calculated animSpeedMs: %d ms\n", lastSettings.speedPercent, animSpeedMs);

    // Double-check that we loaded the correct value
    if (lastSettings.speedPercent >= 80) {
      Serial.printf("SPEED CHECK: High speed loaded (%d%%), animation should be fast\n", lastSettings.speedPercent);
    } else {
      Serial.printf("SPEED CHECK: Slow speed loaded (%d%%), animation will be slow\n", lastSettings.speedPercent);
    }
  } else if (nvs_get_u16(nvs_handle, "animSpeedMs", &u16_val) == ESP_OK) {
    // Fallback to old animSpeedMs (for compatibility with old settings)
    lastSettings.animSpeedMs = u16_val;
    animSpeedMs = lastSettings.animSpeedMs;
    // Estimate percentage from old speed (inverse mapping)
    if (animSpeedMs <= 5) lastSettings.speedPercent = 100;
    else if (animSpeedMs <= 10) lastSettings.speedPercent = 80;
    else if (animSpeedMs <= 15) lastSettings.speedPercent = 60;
    else if (animSpeedMs <= 20) lastSettings.speedPercent = 40;
    else if (animSpeedMs <= 30) lastSettings.speedPercent = 20;
    else lastSettings.speedPercent = 10;
    Serial.printf("Loaded old animSpeedMs: %d ms, estimated speed percentage: %d%%\n", animSpeedMs, lastSettings.speedPercent);
  } else {
    Serial.println("WARNING: speedPercent not found in NVS (first boot after code upload?)");
    lastSettings.speedPercent = 80; // Default speed percentage
    animSpeedMs = 8; // Default is 80% which maps to 8ms (125 FPS)
    if (animSpeedMs < 6) animSpeedMs = 6;
    Serial.printf("Using default speedPercent=%d%%, animSpeedMs=%d ms\n", lastSettings.speedPercent, animSpeedMs);

    // Force save the default speed to prevent future issues
    Serial.println("Force-saving default speed settings...");
    nvs_set_u8(nvs_handle, "speedPercent", lastSettings.speedPercent);
    esp_err_t forceSaveErr = nvs_commit(nvs_handle);
    if (forceSaveErr == ESP_OK) {
      Serial.println("Default speed settings force-saved successfully");
    } else {
      Serial.printf("ERROR: Failed to force-save default speed: %s\n", esp_err_to_name(forceSaveErr));
    }
  }
  if (nvs_get_i16(nvs_handle, "loopOffsetPx", &i16_val) == ESP_OK) {
    lastSettings.loopOffsetPx = i16_val;
    loopOffsetPx = lastSettings.loopOffsetPx;
  }
  if (nvs_get_u16(nvs_handle, "bgColor", &u16_val) == ESP_OK) {
    lastSettings.bgColor = u16_val;
    bgColor = lastSettings.bgColor;
  }
  if (nvs_get_u16(nvs_handle, "textColor", &u16_val) == ESP_OK) {  // ADD: Load text color
    lastSettings.textColor = u16_val;
    textColor = lastSettings.textColor;
  }
  if (nvs_get_u8(nvs_handle, "mode", &u8_val) == ESP_OK) {
    lastSettings.mode = static_cast<DisplayMode>(u8_val);
    currentMode = lastSettings.mode;
  }
  if (nvs_get_u8(nvs_handle, "hasText", &u8_val) == ESP_OK) {
    lastSettings.hasText = (u8_val == 1);
  }
  if (nvs_get_u8(nvs_handle, "hasBgImage", &u8_val) == ESP_OK) {
    lastSettings.hasBgImage = (u8_val == 1);
    hasBgImage = lastSettings.hasBgImage;
  }
  if (nvs_get_u16(nvs_handle, "textWidth", &u16_val) == ESP_OK) {
    lastSettings.textWidth = u16_val;
    imgW = u16_val;
  }
  if (nvs_get_u16(nvs_handle, "textHeight", &u16_val) == ESP_OK) {
    lastSettings.textHeight = u16_val;
    imgH = u16_val;
  }

  // Load animation state
  uint32_t u32_val;
  if (nvs_get_i16(nvs_handle, "scrollX", &i16_val) == ESP_OK) {
    lastSettings.scrollX = i16_val;
    scrollX = i16_val;
  }
  if (nvs_get_u16(nvs_handle, "spacing", &u16_val) == ESP_OK) {
    lastSettings.spacing = u16_val;
  }
  if (nvs_get_u32(nvs_handle, "savedTime", &u32_val) == ESP_OK) {
    lastSettings.savedTime = u32_val;
  }

  if (nvs_get_u8(nvs_handle, "brightness", &u8_val) == ESP_OK) {
    lastSettings.brightness = u8_val;
    currentBrightness = u8_val;
    if (dma_display) {
      dma_display->setBrightness8(lastSettings.brightness);
    }
  }

  nvs_close(nvs_handle);
  Serial.println("Settings loaded from NVS");

  // Animation restoration will be done after text is loaded in loadLastFrame
  Serial.println("Animation settings loaded - will restore after text data is loaded");
}

static void saveLastFrame() {
  if (frameBuffer.empty()) return;

