SoyVitouPro/ESP32-V2/src/main.cpp
      // IMPROVED: Ensure enough copies for seamless scrolling
      // Need enough copies to cover screen width + extra buffer
      const int minCopiesNeeded = (VIRT_W() / spacing) + 2; // Minimum to cover screen
      const int totalCopies = (minCopiesNeeded > 4) ? minCopiesNeeded : 4; // Always have at least 4 copies
      heads.clear();
      heads.reserve(totalCopies);

      // Simple restart from beginning (no complex time compensation)
      if (animDir < 0) { // left scrolling - start from right edge
        for (int i = 0; i < totalCopies; i++) {
          heads.push_back(VIRT_W() + (i * spacing));
        }
      } else { // right scrolling - start from left edge
        for (int i = 0; i < totalCopies; i++) {
          heads.push_back(-imgW - (i * spacing));
        }
      }

      // Use saved scroll position if valid, otherwise start fresh
      if (lastSettings.scrollX != 0) {
        scrollX = lastSettings.scrollX;
        Serial.printf("Using saved scroll position: %d\n", scrollX);
      } else {
        scrollX = 0;
        Serial.println("Starting scroll from position 0");
      }

      Serial.printf("Animation restored: %d heads, spacing=%d, direction=%s, scrollX=%d, loopOffset=%d\n",
                    totalCopies, spacing, (animDir < 0) ? "left" : "right", scrollX, loopOffsetPx);

      waitingRestart = false;
      lastAnim = millis(); // Start animation immediately
    }
  } else {
    Serial.printf("Error loading last frame: read %u of %u bytes\n", (unsigned)read, (unsigned)fileSize);
  }
}

static int indexFromToken(const String& tok) {
  String t = tok; t.toLowerCase(); t.trim();
  if (t.length() == 0) return -1;
  if (t == "main") return 0;
  if (t == "second") return 1;
  if (t == "third") return 2;
  if (t == "fourth") return 3;
  if (t == "fifth") return 4;
  if (t == "sixth") return 5;
  if (t == "seventh") return 6;
  if (t == "eighth") return 7;
  // also accept numeric (1-based or 0-based)
  bool allDigits = true; for (size_t i=0;i<t.length();++i){ if (!isDigit((int)t[i])) { allDigits=false; break; } }
  if (allDigits) {
    int v = t.toInt();
    if (v >= 1) v -= 1; // treat as 1-based index
    return v;
  }
  return -1;
}

// Serve a file from LittleFS
static String contentTypeFor(const String& path) {
  if (path.endsWith(".html")) return "text/html; charset=utf-8";
  if (path.endsWith(".css")) return "text/css";
  if (path.endsWith(".js")) return "application/javascript";
  if (path.endsWith(".png")) return "image/png";
  if (path.endsWith(".ico")) return "image/x-icon";
  return "text/plain";
}

static const char FALLBACK_HTML[] PROGMEM = R"HTML(
<!doctype html><meta charset="utf-8"><meta name="viewport" content="width=device-width,initial-scale=1">
<title>IHUB75</title>
<body style="font-family:system-ui,Arial,sans-serif;padding:16px;line-height:1.5;background:#0b0f14;color:#e7eef7">
<h2 style="margin:0 0 12px">IHUB75</h2>
<p>index.html not found on LittleFS.</p>
<p>Upload it with PlatformIO:</p>
<pre style="background:#121820;padding:12px;border-radius:8px;border:1px solid #1f2a35">pio run -t uploadfs</pre>
<p>Then refresh this page.</p>
</body>
)HTML";

void handleRoot() {
  sendCORSHeaders();
  File f = LittleFS.open("/index.html", "r");
  if (!f) {
    server.send_P(200, "text/html; charset=utf-8", FALLBACK_HTML);
    return;
  }
  server.streamFile(f, contentTypeFor("/index.html"));
  f.close();
}

// Generic file handler for CSS, JS, images, etc.
void handleStaticFile() {
  sendCORSHeaders();
  String path = server.uri();
  if (path == "/") {
    path = "/index.html";
  }

  File f = LittleFS.open(path, "r");
  if (!f) {
    server.send(404, "text/plain", "File not found");
    return;
  }

  String contentType = contentTypeFor(path);
  server.streamFile(f, contentType);
  f.close();
}

static uint16_t hexTo565(const String &hex) {
  // Expect formats like "#RRGGBB" or "RRGGBB"
  String s = hex;
  if (s.startsWith("#")) s.remove(0,1);
  if (s.length() != 6) return 0; // default black
  auto h2 = [](char c)->uint8_t{ if(c>='0'&&c<='9')return c-'0'; c|=0x20; if(c>='a'&&c<='f')return c-'a'+10; return 0; };
  uint8_t r = (h2(s[0])<<4) | h2(s[1]);
  uint8_t g = (h2(s[2])<<4) | h2(s[3]);
  uint8_t b = (h2(s[4])<<4) | h2(s[5]);
  return ((r & 0xF8) << 8) | ((g & 0xFC) << 3) | (b >> 3);
}

void handleUploadData() {
  HTTPUpload& up = server.upload();
  if (up.status == UPLOAD_FILE_START) {
    Serial.println("/upload: START");
    uploadBuf.clear();
    imgW = imgH = 0;
  } else if (up.status == UPLOAD_FILE_WRITE) {
    uploadBuf.insert(uploadBuf.end(), up.buf, up.buf + up.currentSize);
  } else if (up.status == UPLOAD_FILE_END) {
    Serial.printf("/upload: END bytes=%u\n", (unsigned)uploadBuf.size());
    if (uploadBuf.size() < 4) { server.send(400, "text/plain", "Bad image"); return; }
    imgW = uploadBuf[0] | (uploadBuf[1] << 8);
    imgH = uploadBuf[2] | (uploadBuf[3] << 8);
    Serial.printf("Parsed image size: %ux%u\n", imgW, imgH);
    // Allow text wider than panel for scrolling animation
    // Set reasonable limits: max 4x panel width for long text
    const uint16_t maxAllowedWidth = (uint16_t)VIRT_W() * 4;
    if (imgW == 0 || imgH == 0 || imgW > maxAllowedWidth || imgH > (uint16_t)VIRT_H()) {
      Serial.printf("Rejected invalid size: %ux%u (max: %ux%u)\n", imgW, imgH, maxAllowedWidth, (uint16_t)VIRT_H());
      server.send(400, "text/plain", "Invalid size");
      return;
    }
    size_t expected565 = 4 + (size_t)imgW * (size_t)imgH * 2;
    size_t expectedA8_565 = 4 + (size_t)imgW * (size_t)imgH * 3;
    Serial.printf("Expected sizes: RGB565=%u, A8+RGB565=%u, received=%u\n", (unsigned)expected565, (unsigned)expectedA8_565, (unsigned)uploadBuf.size());

    if (uploadBuf.size() == expectedA8_565) {
      // Parse A8 + RGB565 interleaved
      Serial.printf("Parsing A8+RGB565 format\n");
      textPixels.assign((size_t)imgW * (size_t)imgH, 0);
      textAlpha.assign((size_t)imgW * (size_t)imgH, 0);
      const uint8_t* p = &uploadBuf[4];
      for (size_t i = 0; i < (size_t)imgW * (size_t)imgH; ++i) {
        uint8_t a = *p++;
        uint16_t pix = (uint16_t)p[0] | ((uint16_t)p[1] << 8); p += 2;
        textAlpha[i] = a;
        textPixels[i] = pix;
      }
    } else if (uploadBuf.size() == expected565) {
      // Legacy RGB565 only
      Serial.printf("Parsing RGB565 format\n");
      const uint16_t* pixels = reinterpret_cast<const uint16_t*>(&uploadBuf[4]);
      textPixels.assign(pixels, pixels + (imgW * imgH));
      textAlpha.clear();
    } else {
      Serial.printf("Size mismatch error: expected %u or %u bytes, got %u\n", (unsigned)expected565, (unsigned)expectedA8_565, (unsigned)uploadBuf.size());
      server.send(400, "text/plain", "Size mismatch");
      return;
    }
    Serial.printf("/upload: parsed %ux%u mode=%s\n", imgW, imgH, textAlpha.empty()?"RGB565":"A8+RGB565");
    // No response here; will be sent in the completion handler
  }
}

void handleUploadDone() {
  sendCORSHeaders();

  // Stop theme mode if it was running
  if (currentMode == MODE_THEME) {
    Serial.println("Stopping theme mode, switching to clock mode");
  }
  currentMode = MODE_CLOCK;

