SoyVitouPro/ESP32-V2/src/main.cpp
  // Read options - force centering but USE ANIMATION SETTINGS
  bgColor = hexTo565(server.arg("bg"));
  textColor = hexTo565(server.arg("color"));  // ADD: Read text color from upload
  userOffX = 0; // Force center horizontally
  userOffY = 0; // Force center vertically

  // FIX: Read animation parameters from client instead of hardcoding
  animate = (server.arg("animate") == "1");
  animDir = (server.arg("dir") == "right") ? 1 : -1;
  // Speed mapping: 10% = 40ms (slow), 100% = 2ms (fast), with proper interpolation
  if (server.hasArg("speed")) {
    int speedPercent = constrain(server.arg("speed").toInt(), 10, 100);
    // Save both the percentage and the calculated milliseconds
    lastSettings.speedPercent = speedPercent;
    // Reverse mapping: higher percentage = faster animation = lower delay
    // Aggressive speed mapping: 10% = 50ms (20 FPS), 100% = 12.5ms (80 FPS)
    // Special mapping for specific percentages:
    int targetMs;
    if (speedPercent == 10) {
      targetMs = 50;    // 0.5x of 100% speed (20 FPS)
    } else if (speedPercent == 20) {
      targetMs = 25;    // Same as current 100% speed (40 FPS)
    } else if (speedPercent == 40) {
      targetMs = 17;    // 1.5x faster than current 100% (59 FPS)
    } else if (speedPercent == 60) {
      targetMs = 13;    // 2x faster than current 100% (77 FPS)
    } else if (speedPercent == 80) {
      targetMs = 8;     // 3.5x faster than current 100% (125 FPS)
    } else if (speedPercent == 100) {
      targetMs = 6;     // 4x faster than current 100% (167 FPS)
    } else {
      // Linear interpolation between specific points
      targetMs = map(speedPercent, 10, 100, 50, 6);
    }
    animSpeedMs = targetMs;
    // Ensure minimum delay for ultra-fast scrolling
    if (animSpeedMs < 6) animSpeedMs = 6;
    Serial.printf("Upload: speedPercent=%d%%, calculated animSpeedMs=%d ms\n", speedPercent, animSpeedMs);
  } else {
    lastSettings.speedPercent = 80; // Default speed percentage
    animSpeedMs = 8; // Default is 80% which maps to 8ms (125 FPS)
    Serial.printf("Upload: using default speedPercent=%d%%, animSpeedMs=%d ms\n", lastSettings.speedPercent, animSpeedMs);
  }
  loopOffsetPx = server.hasArg("interval") ? constrain(server.arg("interval").toInt(), 1, 300) : 5;

  // DEBUG: Print animation settings to Serial
  Serial.printf("Animation settings: animate=%s, dir=%s, speed=%d ms, interval=%d px\n",
                animate ? "true" : "false",
                (animDir == -1) ? "left" : "right",
                animSpeedMs, loopOffsetPx);
  // brightness percent 0..100
  if (server.hasArg("brightness")) {
    int bp = constrain(server.arg("brightness").toInt(), 0, 100);
    uint8_t b8 = (uint8_t)((bp * 255) / 100);
    currentBrightness = b8;
    dma_display->setBrightness8(b8);
  }
  // Clear cached bg image if switching to plain color
  if (server.hasArg("bgMode") && server.arg("bgMode") == "color") {
    hasBgImage = false;
  }

  // If we have a bitmap, either draw once or start animating
  if (!textPixels.empty()) {
    baseY = (int)VIRT_H() / 2 - (int)imgH / 2 + userOffY; // vertical center + offset
    Serial.printf("/upload: drawing at center x~%d y=%d on %dx%d\n", (int)VIRT_W()/2, baseY, (int)VIRT_W(), (int)VIRT_H());
    waitingRestart = false;
    if (animate) {
      // Initialize multi-head array for continuous text stream
      int gap = (int)loopOffsetPx;
      int spacing = (int)imgW + gap; if (spacing < 1) spacing = 1;

      // Calculate how many copies we need to fill the screen + buffer
      const int totalCopies = ((VIRT_W() + spacing * 2) / spacing) + 3;
      heads.clear();
      heads.reserve(totalCopies);

      if (animDir < 0) { // left scrolling - start from right edge
        for (int i = 0; i < totalCopies; i++) {
          heads.push_back(VIRT_W() + (i * spacing));
        }
      } else { // right scrolling - start from left edge
        for (int i = 0; i < totalCopies; i++) {
          heads.push_back(-imgW - (i * spacing));
        }
      }

      Serial.printf("Initialized %d heads for continuous scrolling\n", totalCopies);
      // Compose full frame offscreen then push
      if (hasBgImage && bgPixels.size() == frameBuffer.size()) {
        frameBuffer = bgPixels;
      } else {
        std::fill(frameBuffer.begin(), frameBuffer.end(), bgColor);
      }
      auto blitAt = [&](int xPos){
        int16_t x0 = xPos + userOffX;
        for (int y=0; y<(int)imgH; ++y) {
          int dstY = baseY + y;
          if (dstY < 0 || dstY >= (int)VIRT_H()) continue;
          int srcRow = y * imgW;
          for (int x=0; x<(int)imgW; ++x) {
            int dstX = x0 + x;
            if (dstX < 0 || dstX >= (int)VIRT_W()) continue;
            size_t si = (size_t)srcRow + (size_t)x;
            size_t di = (size_t)dstY * (size_t)VIRT_W() + (size_t)dstX;
            if (di >= frameBuffer.size()) continue;
            if (!g_panel_active.empty()) {
              int pidx = panelIndexFromXY(dstX, dstY);
              if (pidx >= 0 && pidx < (int)g_panel_active.size() && g_panel_active[pidx] == 0) continue;
            }
            if (!textAlpha.empty()) {
              if (textAlpha[si]) frameBuffer[di] = textPixels[si];
            } else {
              frameBuffer[di] = textPixels[si];
            }
          }
        }
      };
      // Draw all heads for continuous text stream
      for (int i = 0; i < (int)heads.size(); i++) {
        blitAt(heads[i]);
      }
      maskDisabledPanels();
      vdisplay->drawRGBBitmap(0, 0, frameBuffer.data(), VIRT_W(), VIRT_H());
      // ensure animation starts moving immediately on next loop
      lastAnim = millis() - animSpeedMs;
    } else {
      if (hasBgImage && bgPixels.size() == frameBuffer.size()) {
        frameBuffer = bgPixels;
      } else {
        std::fill(frameBuffer.begin(), frameBuffer.end(), bgColor);
      }
      int16_t x = (int)VIRT_W() / 2 - (int)imgW / 2 + userOffX; // horizontal center + offset
      for (int y=0; y<(int)imgH; ++y) {
        int dstY = baseY + y;
        if (dstY < 0 || dstY >= (int)VIRT_H()) continue;
        int srcRow = y * imgW;
        for (int x2=0; x2<(int)imgW; ++x2) {
          int dstX = x + x2;
          if (dstX < 0 || dstX >= (int)VIRT_W()) continue;
          size_t si = (size_t)srcRow + (size_t)x2;
          size_t di = (size_t)dstY * (size_t)VIRT_W() + (size_t)dstX;
          if (di >= frameBuffer.size()) continue;
          if (!g_panel_active.empty()) {
            int pidx = panelIndexFromXY(dstX, dstY);
            if (pidx >= 0 && pidx < (int)g_panel_active.size() && g_panel_active[pidx] == 0) continue;
          }
          if (!textAlpha.empty()) {
            if (textAlpha[si]) frameBuffer[di] = textPixels[si];
          } else {
            frameBuffer[di] = textPixels[si];
          }
        }
      }
      maskDisabledPanels();
      vdisplay->drawRGBBitmap(0, 0, frameBuffer.data(), VIRT_W(), VIRT_H());
    }

    // Save settings and last frame
    saveLastSettings();
    saveLastFrame();
  }
  server.send(200, "text/plain", "OK");
}

// Handle background image upload at /upload_bg
// Expects RGB565 little-endian with 4-byte header [wL,wH,hL,hH]
void handleUploadBgData() {
  HTTPUpload& up = server.upload();
  static std::vector<uint8_t> buf;
  static uint16_t bw = 0, bh = 0;
  if (up.status == UPLOAD_FILE_START) {
    buf.clear(); bw = bh = 0;
  } else if (up.status == UPLOAD_FILE_WRITE) {
    buf.insert(buf.end(), up.buf, up.buf + up.currentSize);
  } else if (up.status == UPLOAD_FILE_END) {
    if (buf.size() < 4) { server.send(400, "text/plain", "Bad image"); return; }
    bw = buf[0] | (buf[1] << 8);
    bh = buf[2] | (buf[3] << 8);
    size_t expected = 4 + (size_t)bw * (size_t)bh * 2;
    if (buf.size() != expected) { server.send(400, "text/plain", "Size mismatch"); return; }
    // Resize bgPixels to panel size and blit (centered if different size)
    bgPixels.assign((size_t)VIRT_W() * (size_t)VIRT_H(), bgColor);
    const uint16_t* src = reinterpret_cast<const uint16_t*>(&buf[4]);
    int offx = ((int)VIRT_W() - (int)bw) / 2;
    int offy = ((int)VIRT_H() - (int)bh) / 2;
    for (int y=0; y<(int)bh; ++y) {
      int dy = offy + y; if (dy < 0 || dy >= (int)VIRT_H()) continue;
      for (int x=0; x<(int)bw; ++x) {
        int dx = offx + x; if (dx < 0 || dx >= (int)VIRT_W()) continue;
        bgPixels[(size_t)dy * VIRT_W() + (size_t)dx] = src[(size_t)y * bw + (size_t)x];
      }
    }
    hasBgImage = true;
    // Show background immediately if no text
    if (textPixels.empty()) {
      if (bgPixels.size() == (size_t)VIRT_W() * (size_t)VIRT_H()) {
        vdisplay->drawRGBBitmap(0, 0, bgPixels.data(), VIRT_W(), VIRT_H());
        // Save background as last frame
        frameBuffer = bgPixels;
        saveLastSettings();
        saveLastFrame();
      } else {
        vdisplay->fillScreen(bgColor);
      }
    }
  }
}

void handleUploadBgDone() {
  sendCORSHeaders();
  // No additional args needed; just acknowledge
  server.send(200, "text/plain", "OK");
}

// Handle theme file upload at /upload_theme
void handleUploadTheme() {
  HTTPUpload& up = server.upload();
  static File themeFile;

  if (up.status == UPLOAD_FILE_START) {
    Serial.println("/upload_theme: START");
    // Open file for writing
    themeFile = LittleFS.open("/theme.html", "w");
    if (!themeFile) {
      Serial.println("/upload_theme: Failed to open file for writing");
    }
  } else if (up.status == UPLOAD_FILE_WRITE) {
    if (themeFile) {
      themeFile.write(up.buf, up.currentSize);
    }
  } else if (up.status == UPLOAD_FILE_END) {
    Serial.printf("/upload_theme: END bytes=%u\n", (unsigned)up.totalSize);
    if (themeFile) {
      themeFile.close();
      Serial.println("/upload_theme: Theme saved to /theme.html");

