SoyVitouPro/ESP32-V2/src/main.cpp
  // Brief yield to ensure smooth clock timing
  if (serverTime > 1) {
    delay(1); // Small delay to prevent blocking
  }

  // Animate if enabled, we have a text bitmap, and we're in clock mode
  if (animate && !textPixels.empty() && currentMode == MODE_CLOCK) {
    uint32_t now = millis();

    // Ultra-fast animation timing optimization
    uint32_t adjustedTime = now;

    // More aggressive compensation for server handling time
    if (serverTime > 2) {
      // Compensate for any server time > 2ms to maintain smooth animation
      adjustedTime = now + (serverTime - 2);
    }

    // Ultra-fast timing check with microsecond precision for smooth animation
    uint32_t timeDiff = adjustedTime - lastAnim;

    // Use sub-millisecond timing for ultra-smooth animation at fastest speeds
    if (timeDiff >= animSpeedMs) {
      // Only log occasionally to avoid Serial Monitor flooding
      static uint32_t debugCounter = 0;
      if (++debugCounter % 200 == 0) { // Log every 200th frame (even less frequent)
        Serial.printf("Smooth animation: speed=%dms, serverTime=%lums, timeDiff=%lums\n", animSpeedMs, serverTime, timeDiff);
      }
      lastAnim = adjustedTime;

      // Optimized background composition - use cached background when possible
      if (hasBgImage && bgPixels.size() == frameBuffer.size()) {
        // Fast copy for background image
        std::copy(bgPixels.begin(), bgPixels.end(), frameBuffer.begin());
      } else {
        // Optimized fill for solid color
        std::fill(frameBuffer.begin(), frameBuffer.end(), bgColor);
      }

      // Optimized text blitting - reduce function call overhead
      const bool hasAlpha = !textAlpha.empty();
      const uint16_t frameW = VIRT_W();

      // Pre-calculate frequently used values
      const int imgH_local = imgH;
      const int imgW_local = imgW;
      const int baseY_local = baseY;
      const int userOffX_local = userOffX;

      // Optimized blit function
      for (int i = 0; i < (int)heads.size(); i++) {
        int16_t x0 = heads[i] + userOffX_local;

        // Bounds checking optimization
        if (x0 + imgW_local <= 0 || x0 >= frameW) continue;

        // Optimized inner loops with minimal bounds checks
        for (int y = 0; y < imgH_local; ++y) {
          int dstY = baseY_local + y;
          if (dstY < 0 || dstY >= (int)VIRT_H()) continue;

          int srcRow = y * imgW_local;
          size_t frameRow = (size_t)dstY * frameW;

          // Optimized inner loop with pre-calculated bounds
          int startX = (x0 < 0) ? -x0 : 0;
          int endX = (x0 + imgW_local > frameW) ? (frameW - x0) : imgW_local;

          for (int x2 = startX; x2 < endX; ++x2) {
            int dstX = x0 + x2;
            size_t si = (size_t)srcRow + (size_t)x2;
            size_t frameIdx = frameRow + (size_t)dstX;

            // Optimized alpha checking
            if (!hasAlpha || textAlpha[si]) {
              frameBuffer[frameIdx] = textPixels[si];
            }
          }
        }
      }

      // Display the updated frame
      vdisplay->drawRGBBitmap(0, 0, frameBuffer.data(), VIRT_W(), VIRT_H());

      // advance all heads - optimized
      const int gap = (int)loopOffsetPx;
      int spacing = (int)imgW_local + gap;
      if (spacing < 1) spacing = 1; // Ensure minimum spacing

      if (animDir < 0) { // left scrolling
        // Move all heads left
        for (int i = 0; i < (int)heads.size(); i++) {
          heads[i] -= 1;
        }

        // Recycle any head that goes completely off screen - FIXED VERSION
        for (int i = 0; i < (int)heads.size(); i++) {
          if (heads[i] + imgW <= 0) {
            // Find the rightmost head to position after it
            int rightmost = heads[0];
            for (int j = 1; j < (int)heads.size(); j++) {
              if (heads[j] > rightmost) rightmost = heads[j];
            }
            // Position immediately after the rightmost head with proper spacing
            heads[i] = rightmost + spacing;
            // Debug: ensure smooth transition
            // Serial.printf("Recycled head %d: old pos=%d, new pos=%d, spacing=%d\n", i, heads[i] - spacing, heads[i], spacing);
          }
        }
      } else { // right scrolling
        // Move all heads right
        for (int i = 0; i < (int)heads.size(); i++) {
          heads[i] += 1;
        }

        // Recycle any head that goes completely off screen - FIXED VERSION
        for (int i = 0; i < (int)heads.size(); i++) {
          if (heads[i] >= VIRT_W()) {
            // Find the leftmost head to position before it
            int leftmost = heads[0];
            for (int j = 1; j < (int)heads.size(); j++) {
              if (heads[j] < leftmost) leftmost = heads[j];
            }
            // Position immediately before the leftmost head with proper spacing
            heads[i] = leftmost - spacing;
            // Debug: ensure smooth transition
            // Serial.printf("Recycled head %d: old pos=%d, new pos=%d, spacing=%d\n", i, heads[i] + spacing, heads[i], spacing);
          }
        }
      }
    }
  } else {
    delay(2); // yield CPU when idle
  }
}